title: Possible DLL Hijacking of providers.dll
id: 4710111b-5388-48a3-9769-5b9ff8810087
status: experimental
description: Detects possible DLL hijacking of providers.dll by looking for suspicious image loads, loading this DLL from unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/npm/providers.html
author: "Wietze Beukema"
date: 2022-08-01
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: image_load
detection:
    selection:
        ImageLoaded: '*\providers.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

