title: Possible DLL Hijacking of shellchromeapi.dll
id: 8858351b-5254-48a3-5583-5b9ff8382261
status: experimental
description: Detects possible DLL hijacking of shellchromeapi.dll by looking for suspicious image loads, loading this DLL from unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/shellchromeapi.html
author: "Wietze Beukema"
date: 2023-07-28
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: image_load
detection:
    selection:
        ImageLoaded: '*\shellchromeapi.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

