title: Possible DLL Hijacking of log.dll
id: 9451181b-1318-48a3-1317-5b9ff8166908
status: experimental
description: Detects possible DLL hijacking of log.dll by looking for suspicious image loads, loading this DLL from unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/bitdefender/log.html
author: "Wietze Beukema"
date: 2022-06-13
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: image_load
detection:
    selection:
        ImageLoaded: '*\log.dll'
    filter:
        ImageLoaded:
            - 'c:\program files\Bitdefender Antivirus Free\*'
            - 'c:\program files (x86)\Bitdefender Antivirus Free\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

