title: Possible preparation for cdpsgshims.dll DLL Hijacking
id: 4611702b-9122-48a3-7130-5b9ff8297414
status: experimental
description: Detects possible DLL hijacking of cdpsgshims.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/cdpsgshims.html
author: "k4nfr3"
date: 2022-08-15
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\cdpsgshims.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

