title: Possible preparation for tmtap.dll DLL Hijacking
id: 8739702b-2945-48a3-7988-5b9ff8844509
status: experimental
description: Detects possible DLL hijacking of tmtap.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/trendmicro/tmtap.html
author: "Wietze Beukema"
date: 2022-05-26
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\tmtap.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

