title: Possible preparation for relay.dll DLL Hijacking
id: 4509562b-2773-48a3-5383-5b9ff8502377
status: experimental
description: Detects possible DLL hijacking of relay.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/canon/relay.html
author: "Jai Minton - HuntressLabs"
date: 2024-05-27
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\relay.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

