title: Possible preparation for quickdeskband.dll DLL Hijacking
id: 8061492b-6843-48a3-5852-5b9ff8483736
status: experimental
description: Detects possible DLL hijacking of quickdeskband.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/lenovo/quickdeskband.html
author: "Wietze Beukema"
date: 2024-07-15
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\quickdeskband.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

