title: Possible preparation for wptsextensions.dll DLL Hijacking
id: 5524022b-9122-48a3-7130-5b9ff8916642
status: experimental
description: Detects possible DLL hijacking of wptsextensions.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/wptsextensions.html
author: "k4nfr3"
date: 2022-08-15
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\wptsextensions.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

