title: Possible preparation for providers.dll DLL Hijacking
id: 4710112b-5388-48a3-9769-5b9ff8810087
status: experimental
description: Detects possible DLL hijacking of providers.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/npm/providers.html
author: "Wietze Beukema"
date: 2022-08-01
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\providers.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

