title: Possible preparation for utiluniclient.dll DLL Hijacking
id: 8929172b-5805-48a3-6769-5b9ff8388944
status: experimental
description: Detects possible DLL hijacking of utiluniclient.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/trendmicro/utiluniclient.html
author: "Wietze Beukema"
date: 2021-02-28
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\utiluniclient.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

