title: Possible preparation for wow64log.dll DLL Hijacking
id: 1854582b-8475-48a3-5606-5b9ff8458296
status: experimental
description: Detects possible DLL hijacking of wow64log.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/wow64log.html
author: "ice-wzl"
date: 2025-01-01
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\wow64log.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

