title: Possible preparation for outllib.dll DLL Hijacking
id: 3802402b-1318-48a3-1317-5b9ff8856876
status: experimental
description: Detects possible DLL hijacking of outllib.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/external/outllib.html
author: "Wietze Beukema"
date: 2022-06-13
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\outllib.dll'
    filter:
        TargetFileName:
            - 'c:\program files\Microsoft Office\OFFICE*\*'
            - 'c:\program files (x86)\Microsoft Office\OFFICE*\*'
            - 'c:\program files\Microsoft Office\Root\OFFICE*\*'
            - 'c:\program files (x86)\Microsoft Office\Root\OFFICE*\*'
            - 'c:\program files\Microsoft Office *\ClientX86\Root\Office*\*'
            - 'c:\program files (x86)\Microsoft Office *\ClientX86\Root\Office*\*'
            - 'c:\program files\Microsoft Office *\ClientX64\Root\Office*\*'
            - 'c:\program files (x86)\Microsoft Office *\ClientX64\Root\Office*\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

