title: Possible preparation for offdmpsvc.dll DLL Hijacking
id: 1236342b-2879-48a3-1562-5b9ff8542681
status: experimental
description: Detects possible DLL hijacking of offdmpsvc.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/offdmpsvc.html
author: "Swachchhanda Shrawan Poudel"
date: 2025-06-17
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\offdmpsvc.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

